Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/passports/irish_passport_card.html.txt.tmx
Source language: en
Languages: ga

source: The Department of Foreign Affairs and Trade has introduced a credit-card sized Irish passport card which you can use for travel within the European Union/European Economic Area (includes Iceland, Liechtenstein and Norway) and Switzerland
ga: Tá cárta nua, a bhfuil cruth chárta creidmheasa air, tugtha isteach ag an Roinn Gnóthaí Eachtracha agus Trádála ar féidir leat a úsáid le haghaidh taistil laistigh den Aontas Eorpach agus sa Limistéar Eorpach Eacnamaíoch (an Íoslainn, Lichtinstéin agus an Iorua)

source: For all other travel you must use your passport book, that is, your normal passport
ga: I gcás gach taistil eile ní mór duit do leabhar pas a úsáid, sé sin, do ghnáthphas

source: The card has a maximum validity of 5 years
ga: Tá uasthréimhse bailíochta 5 bliana ag do chárta

source: You apply for the card online
ga: Déanann tú iarratas ar an gcárta ar líne nó ar aip don bhfón cliste

source: You must be aged 18 or over when applying for the passport card
ga: Ní mór a bheith os cionn 18 bliain d’aois nuair a dhéanann tú iarratas ar chárta pas

source: You must hold a valid Irish passport with at least 3 months' validity
ga: Ní mór go mbeadh pas Éireannach bailí agat a bhfuil bailíocht 30 lá ar a laghad aige agat

source: The personal details you provide when applying must be exactly the same as those on your passport book
ga: Ní mór go mbeadh na sonraí pearsanta a sholáthraíonn tú nuair a dhéanann tú iarratas díreach mar a chéile leo siúd ar do phas bailí

source: The card is valid for a maximum of 5 years or the remaining validity of your passport
ga: Beidh an cárta bailí ar feadh uasthréimhse 5 bliana ar a laghad nó don achar bailíochta atá fágtha ar do phas

source: If you intend travelling using your passport card, you must use the passport card number when checking in online
ga: Má tá sé beartaithe agat dul ag taisteal le do chárta pas nua, ní mór duit uimhir an chárta pas a úsáid agus tú ag seiceáil isteach ar líne

source: Lost or stolen card
ga: Cárta caillte nó goidte

source: If your passport card is lost, stolen or damaged, you should indicate the loss, theft or damage of your card on the relevant section of the online application form when reapplying for a new card
ga: Má chailltear do chárta pas, nó má ghoidtear nó má dhéantar damáiste dó, ba chóir duit an caillteanas, goid nó damáiste sin a chur in iúl ar an gcuid ábhartha d’fhoirm iarratais ar líne agus tú ag cur isteach in athuair ar chárta nua

source: If you are not reapplying for a new card you should notify the Passport Service of the loss or theft by completing the contact form
ga: Mura bhfuil tú ag cur isteach in athuair ar chárta nua ba chóir duit é sin a chur in iúl do sheirbhís na bpasanna tríd an fhoirm theagmhála seo

source: The passport card costs €35. For applicants from outside Ireland, there is an additional delivery cost of €5
ga: Cosnaíonn an cárta pas €35 Tá táille seachadta breise de €5 má tá iarratas á dhéanamh agat ó áit lasmuigh Éirinn

source: Payment is made using a debit or credit card
ga: Íoctar sin le cárta dochair nó creidmheasa

source: You can apply for a passport card online
ga: Beidh na nithe seo a leanas ag teastáil uait chun iarratas a dhéanamh:

source: When making the application you need:
ga: Ní mór duit an caighdeán riachtanach seo a chomhlíonadh:

source: • Your current passport book
ga: • Ní mór gotha neodrach a bheith ort (béal dúnta, gan meangadh gáire)

source: • Your photograph (see the detailed guidelines on dfa.ie)
ga: • Níor chóir go mbeadh aon scáth ar d’éadan nó timpeall ar na súile

source: • A debit or credit card
ga: • Níor chóir duit éide a chaitheamh (sibhialta nó míleata)

source: When you submit your application online you are issued with an 11-digit application number
ga: Nuair a chuireann tú isteach d’iarratas ar líne eisítear uimhir 11-digit duit

source: You can track your application’s progress on the Department’s website using the application number
ga: Is féidir leat d’iarratas a rianú ar líne ar láithreán gréasáin na Roinne ag baint úsáide as d’uimhir iarratais

source: You can find more information in the Department’s list of FAQs
ga: Is féidir leat eolas breise a fháil i liosta ceisteanna coitianta na Roinne
